{
  "title": "Rohit Suratekar",
  "common": {
    "go_there": "Go There"
  },
  "nav": {
    "home": "Home",
    "professional": "Professional",
    "artist": "Artist",
    "settings": "Settings",
    "research": "Research",
    "developer": "Developer",
    "about": "About Me",
    "photography": "Photography",
    "draw": "Drawing",
    "design": "Designing"
  },
  "about": {
    "details": "Hello :) I am Rohit Suratekar and this website portrays my skill set! I was born and grew up in a middle-class family in the small city of Kolhapur in the western Indian state of Maharashtra, known for its vibrant culture. Since my childhood, my dream profession has shifted from becoming a Pokemon master, WWE wrestler, poet, engineer to finally a scientist. By the way, I know Marathi, Hindi and English. In addition, I have formally studied Sanskrit and Russian.",
    "alma": "Alma Mater",
    "postdoctoral": "Postdoctoral Fellow",
    "development": "in Developmental Biology",
    "phd": "Doctor of Philosophy",
    "comp": "in Computational Biology",
    "btech": "Bachelor of Technology",
    "biotech": "in Biotechnology",
    "ncbs": "National Centre for Biological Sciences, TIFR, Bangalore, India",
    "iimcb": "International Institute of Molecular and Cell Biology, Warsaw, Poland",
    "mnnit": "Motilal Nehru National Institute of Technology, Allahabad, India"
  },
  "research": {
    "area_title": "Area of Research",
    "area": "Computational Biology and Mathematical Modelling",
    "current_title": "Current Project",
    "current": "Deciphering the dynamics of transcriptional regulatory networks of zebrafish heart development with mathematical modelling. ( in {lab} , IIMCB, Warsaw )",
    "winata_lab": "Winata Lab",
    "thesis_title": "PhD Thesis",
    "thesis": "Understanding structure and dynamics of the Drosophila PI(4,5)P2 cycle with mathematical models. ( in {lab}, NCBS, Bangalore )",
    "krishna_lab": "Krishna Lab",
    "btech_title": "B.Tech. Thesis",
    "btech": "Indirect and Direct Effect of Turbulence on Bacterial growth.",
    "publications": "Publications and Preprints",
    "data_title": "Data Science",
    "data": "{lab} - Data Science and Visualization Blog ",
    "weird": "WeirdData",
    "conference": "Research Talks and Posters",
    "talk": "Research Talk",
    "talk_title": "Talk Title",
    "poster_title": "Poster Title"
  },
  "developer": {
    "background_title": "Background",
    "background": "My stint with coding started with C++ during my bachelors. I also had some experience in coding for flash games in Action Script. In early 2012, I shifted to coding in higher level languages like, Perl and Matlab while pursuing a project on {codons}, which required data mining and statistics. Later on, in 2015, I gradually started shifting my coding base to Python to aid the ongoing computational biology projects in my PhD. During the course of my PhD, I have learnt various programming languages as a hobby. These were the building blocks of many projects and research assignments, some of which are open source and can be accessed from {github}.",
    "codons": "Codons",
    "github": "GitHub",
    "platforms_title": "Platforms",
    "platforms": "Android, Angular, Windows, Linux, Unity, Jekyll, Arduino",
    "proficient": "Proficient",
    "can_code": "Can Code",
    "learning": "Learning",
    "case_studies": "Case Studies",
    "check": "Check it here",
    "public_title": "Public Profiles",
    "bitbucket": "Bitbucket",
    "gitlab": "GitLab",
    "stack": "StackOverflow",
    "public": "Almost all of my projects are Open Source and are available freely on famous public repositories. Please check my following public profiles which enlists all of my public projects.",
    "ncbs": {
      "title": "Information About NCBS",
      "platform": "Android",
      "details": "My android development experience started with MIT App Inventor. Soon I realized that I was hitting limitations of it. Then I started learning Java for the same. During that time, as a learning project, I started building small app for checking transport timings for our university bus services. But soon this utility spread across campus and now it has around 400 daily users (as of March 2020)"
    },
    "web": {
      "title": "This Website",
      "platform": "Vue.js",
      "details": "I built this website from scratch. Initially I was using web template to build this personal website. All free templates were very limited in functionality. Hence, I decided to make one from scratch. To keep up with latest technology, I decided to learn Angular 2 and Typescript to make this website. Later on I shifted to Vue.js .This current website is outcome of that effort."
    },
    "secretcolor": {
      "title": "SecretColor Library",
      "platform": "Python",
      "details": "My first Python library. I created this to have pretty visualization in my data-science workflow."
    },
    "cardio": {
      "title": "CardioPipeLine",
      "platform": "SnakeMake, R, Python",
      "details": "Automated NGS analysis which uses state of art methods and algorithms to analyze public RNA-seq data."
    }
  },
  "artist": {
    "photography": "Photography",
    "photography_details": "The inevitable attraction",
    "sketching": "Pencil Sketching",
    "sketching_details": "The oldest surviving art form",
    "digital": "Digital Drawing",
    "digital_details": "Old habits with a touch of technology",
    "writing": "Writing",
    "writing_details": "Thoughts penned on paper",
    "cinematography": "Cinematography",
    "cinematography_details": "Started along with photography. Still a newbie!",
    "comics": "Comics",
    "comics_details": "The most recent fascination"
  },
  "photography": {
    "details": "I have always been attracted towards visual art and spent a considerable part of my childhood clicking photographs from my father’s vintage camera. Fascinated by the advent of digital technology, like many others, I resorted to capturing moments from my new digital camera, which was gifted to me by my father to mark my graduation from college. However, my real experience with photography started when I laid my hands on a SLR camera in early 2014. Soon I became a so-called amateur with photography, as well as cinematography. ",
    "details_title": "How it all started ?",
    "bag": "Canon 600D, Canon EF-S 18-55mm f/3.5-5.6 IS II, Canon EF-S 55 - 250 mm f/4-5.6 IS II, Yongnuo 50mm f/1.8, Canon EF 100mm f/2.8L Macro, GoPro HERO 2018, Vanguard CX203AGH Espod, Fotopro C-4i, Few triggers and Filters.",
    "bag_title": "What do I have ?",
    "fav_title": "What do I like ?",
    "fav": "Though I like experimenting with various genres of photography, in general, macro photography has been a personal favourite."
  },
  "draw": {
    "details": "Like most small children, I started scribbling on any blank space that was available, be it on newspapers or empty walls. My mother being a good painter herself, was very enthusiastic to nurture the artist in me. I like sketching, and currently exploring various aspects of comic art."
  }
}