{
  "background": "From my early school years to my time in university, I have embarked on a journey of artistic exploration, delving into diverse art forms ranging from the captivating realm of poetry to the enchanting world of cinematography. Here, I showcase some of the prominent art forms that have shaped my creative path. However, this is only the beginning of my artistic odyssey as I continuously seek to push boundaries and discover new horizons.",
  "sections": [
    {
      "title": "Photography",
      "description": "Capturing moments and stories through the lens.",
      "icon": "camera",
      "link": "/photography"
    },
    {
      "title": "Pencil Sketching",
      "description": "Bringing imagination to life with intricate pencil strokes.",
      "icon": "pencil",
      "link": "/draw"
    },
    {
      "title": "Digital Drawing",
      "description": "Combining technology and artistry to create vibrant digital art.",
      "icon": "mouse",
      "link": "/design"
    },
    {
      "title": "Writing",
      "description": "Expressing thoughts, emotions, and ideas through the power of words.",
      "icon": "pen",
      "link": "/write"
    },
    {
      "title": "Cinematography",
      "description": "Crafting visually stunning narratives that come to life on the screen.",
      "icon": "film",
      "link": "/cinematography"
    },
    {
      "title": "Comics",
      "description": "Weaving humor and storytelling into visually captivating comic strips.",
      "icon": "face",
      "link": "/comics"
    }
  ],
  "photography": {
    "summary": "From an early age, I had a deep fascination with visual art, dedicating a significant portion of my childhood to capturing photographs using my father's classic camera. As the digital era unfolded, I, like countless others, embraced the advancements in technology and began documenting moments with my new digital camera, a thoughtful gift from my father to commemorate my college graduation. Nevertheless, it was in early 2014 that my genuine journey into the realm of photography truly commenced, when I obtained an SLR camera. Since then, I have eagerly explored both photography and cinematography, embracing the label of an enthusiastic amateur in both fields.",
    "gearsDetails": "In my photography arsenal, I have a range of versatile and high-quality equipment to capture stunning images. Here's a list of the gear I use.",
    "galleryLinks": [
      {
        "title": "Instagram",
        "icon": "insta",
        "url": "",
        "external": "http://instagram.com/rohitsuratekar"
      },
      {
        "title": "500px",
        "icon": "500px",
        "url": "",
        "external": "https://500px.com/p/rohitsuratekar"
      },
      {
        "title": "GuruShots",
        "icon": "circle",
        "url": "",
        "external": "https://gurushots.com/rohitsuratekar/photos"
      }
    ],
    "gears": {
      "Camera": [
        {
          "item": "Canon 600D",
          "desc": "A reliable and capable DSLR camera that delivers excellent image quality."
        },
        {
          "item": "GoPro HERO 2018",
          "desc": "Compact and rugged action camera that can go anywhere with you in your adventure."
        },
        {
          "item": "Canon G7x Mark III",
          "desc": "A compact powerhouse with exceptional performance, perfect for quick travel."
        }
      ],
      "Lenses": [
        {
          "item": "Canon EF-S 18-55mm f/3.5-5.6 IS II",
          "desc": "A versatile standard zoom lens suitable for various shooting scenarios."
        },
        {
          "item": "Canon EF-S 55-250mm f/4-5.6 IS II",
          "desc": "A telephoto zoom lens ideal for capturing distant subjects."
        },
        {
          "item": "Yongnuo 50mm f/1.8",
          "desc": "A prime lens known for its sharpness and beautiful bokeh."
        },
        {
          "item": "Canon EF 100mm f/2.8L Macro",
          "desc": "A specialized macro lens for detailed close-up photography."
        }
      ],
      "Tripods": [
        {
          "item": "Vanguard CX203AGH Espod",
          "desc": "Sturdy tripod that provides stable support for my camera during long exposures or when shooting in challenging conditions."
        },
        {
          "item": "Fotopro C-4i",
          "desc": "Lightweight tripod, perfect for travel photography, allowing you to capture steady shots on the go."
        }
      ],
      "Triggers and Filters": [
        {
          "item": "Hoya/Yongnuo/NiSi",
          "desc": "My collection of triggers and filters adds a professional touch to the photography, enhancing the colors, reducing glare, and expanding your creative possibilities."
        }
      ]
    }
  },
  "drawing": {
    "summary": "As a child, I was drawn to any blank space, be it newspapers or empty walls, where I'd scribble with enthusiasm. My mother, a talented painter, nurtured the artist in me. Today, I cherish the art of sketching and delve into various aspects of comic art. On this platform, I proudly present some of my earliest pencil sketches, dating back to 2002. Join me on this journey of creativity and imagination!"
  },
  "digital": {
    "summary": "Embracing technology, I harmonize my time-honored painting and drawing skills to create captivating digital art pieces. Journey through a diverse realm of my digital art gallery, where imaginative landscapes and mesmerizing portraits come to life. Witness the seamless blend of the past and the future, where each stroke on the digital canvas tells a unique and heartfelt story.",
    "skills": [
      {
        "title": "Photo Editing",
        "desc": "Adobe Photoshop, Darktable, Lightroom, Photopea, GIMP"
      },
      {
        "title": "Vector Drawing",
        "desc": "Adobe Illustrator, InkSpace"
      },
      {
        "title": "Digital Sketching",
        "desc": "Adobe Photoshop, Krita"
      },
      {
        "title": "3D Art",
        "desc": "Blender, Autodesk 3ds Max"
      },
      {
        "title": "Video Editing",
        "desc": "Premiere Pro, Media Encoder, Kdenlive"
      },
      {
        "title": "Animation and Stop Motion",
        "desc": "After Effects, Dragonframe"
      }
    ]
  },
  "writing": {
    "summary": "I have had a profound connection with the art of writing, which blossomed during my school days while designing for small magazines. My involvement in drama performances also nurtured my flair for fiction writing. However, it was in the realm of poetry where I truly found my voice, crafting Marathi poems that have been published in diverse magazines. Although my passion for poetry remains, I owe the foundation of this skill to my constant source of encouragement, my father. Through this platform, I am delighted to share my writing endeavors with my cherished readers.",
    "poems": [
      {
        "title": "आठवण",
        "text": "सकाळची किरणे कोवळी असायची <br> चहाचा सुगंध त्यांच्यात मिसळून ती खूप वेगळीच वाटायची <br> रात्रीची झोप ते डोळे अर्धवट धरून ठेवायची <br> अर्ध्या किरणांमुळे त्यांची अर्धीच प्रतिमा दिसायची <br><br> सकाळचा नाश्ता म्हणजे संपूर्ण जेवणच <br> घड्याळाची टिक टिक त्या लोणच्यात झोंबायची <br> कालचा गृहपाठ म्हणजे वार्षिक परीक्षाच <br> गडबडीतल्या उपदेशाने संपूर्ण चपाती करपायची<br><br> ढगांचा रंग लालसर झाला कि कान टोकरायचे <br> कुंफनाची चाके करा करा वाजायची <br> राजाच्या शेपटीचा आवाज यातूनच ऐकायचा <br> उतावळेपणाने नजर गाडीच्या आवाजात घुंफायची <br><br> रात्रीचा बेत ठरवत चहाला झुरकी मारायची <br> कालची अर्धवट गोष्ट आजही पुरून उरायची <br> परवाची बातमी अजूनही कानात झुरायची <br> शोधावेड्या मनाला आजही आठवण करायची"
      },
      {
        "title": "आयुष्य मर्यादित आहे म्हणे",
        "text": "आयुष्य मर्यादित आहे म्हणे <br> म्हणून शिकायला लागलो <br> आकर्षण वाटले नाही म्हणून <br> कविता करू लागलो <br><br>कवी लोकांना वाईट दिवस आहेत म्हणे <br> म्हणून अभियंता झालो <br> पोटासाठी काही तरी केले पाहिजे म्हणून <br> नोकरी करू लागलो <br><br> नोकरीत काही रस नाही म्हणे <br> म्हणून उच्चशिक्षित झालो<br> विज्ञानासाठी काही तरी केले पाहिजे म्हणून<br> संशोधन करू लागलो<br><br> संशोधनात काही हाताला लागत नाही म्हणे<br> म्हणून स्वतः चा धंदा करू लागलो<br> समाजासाठी काही तरी केले पाहिजे म्हणून<br> समाजसेवा करू लागलो<br><br> समाजसेवेत राजनीती असते म्हणे<br> म्हणून घरात बसून राहिलो<br> आयुष्य मर्यादित आहे म्हणे<br> म्हणून पुन्हा शिकायला लागलो"
      },
      {
        "title": "कधी एकदा ...",
        "text": "कधीतरीच ते फुलपाखरू त्या झाडावर जाते <br> त्याच्या छोट्या आयुष्याचा विचार केला तर <br> केवढा वेळ मिळत असेल त्यावर ?<br> आजू बाजूला आहेत भरपूर फुलझाडे <br> त्याच्या पसंतीचा विचार केला तर <br> जगावेगळी वाटत नाही काय ?<br> झाडावर आहेत भरपूर भक्षक <br> त्याच्या धाडसाचा विचार केला तर<br> त्याला भीती वाटत नसेल काय ?<br> जूने सवंगडी सारखे खुणावत आहेत <br> त्यांच्या अनुभवाचा विचार केला तर <br> त्याने निर्णय बदलला पाहिजे ना ?<br> त्या इकडून तिकडे तिकडून इकडे घिरट्या <br> अश्या वागण्याचा विचार केला तर <br> त्याच्या मानत विचारांचे काहुर असेल काय ?"
      },
      {
        "title": "साहेब आमच्याकड नशिबाच नाय !",
        "text": "रोज काम कारायला जातो <br>अंगात दम असेल तोवर काम करतो<br>५०-१०० रुपयात समाधान मानतो<br>रात्री झोपताना नशिबालाच दोष देतो<br>साहेब आमच्याकड नशिबाच नाय !<br><br>रोज साहेबांच्या गाडी कडे टक लावून पाहतो<br>मनातल्या मनात गाडी चालवून पाहतो<br>शेवटी चालतच घरी पोहचतो<br>रात्री घरी परताना नशिबालाच दोष देतो<br>साहेब आमच्याकड नशिबाच नाय !<br><br>रोज त्या दुकानातील मिठाई बघतो<br>कधीतरी खाण्यासाठी पैसे गोळा करतो<br>नंतर तीच रक्कम मीठ-साखर आणायला वापरतो<br>रात्री जेवताना नशिबालाच दोष देतो<br>साहेब आमच्याकड नशिबाच नाय !<br><br>रोज बाजुश्याशी स्पर्धा करतो<br>जीव तोडून काम करण्याची शप्पथ घेतो<br>दोन दिवसांनी लायकी नाही म्हणतो<br>रात्री स्वप्नातही नशिबालाच दोष देतो<br>साहेब आमच्याकड नशिबाच नाय !<br><br>परिस्थितीने असे झाले कि<br>आपल्यामुळे अशी परिस्थिती झाली<br>कुठलीही बाजू असुदे<br>शेवटी नशिबालाच दोष देतो<br>साहेब आमच्याकड नशिबाच नाय !"
      }
    ]
  },
  "cinematography": {
    "summary": "During my photography journey, I delved into the world of videography and cinematography, expanding my creative horizons. Engaging in various projects, I honed my skills, capturing mesmerizing moments in motion. Embracing continuous improvement, I am dedicated to mastering this art form and have also acquired post-processing expertise to enhance the final visual impact.",
    "types": [
      {
        "title": "Cinematography",
        "projects": [
          {
            "title": "The Scientist (2017)",
            "link": "https://www.youtube.com/watch?v=0gedMXoTgTY",
            "description": "A short film about the typical life of a researcher"
          },
          {
            "title": "Tick-Tock",
            "link": "https://www.youtube.com/watch?v=_Kq_09YzXcc",
            "description": "Open Sky Slam poetry"
          }
        ]
      },
      {
        "title": "Timelapse Videos",
        "projects": [
          {
            "title": "Misty Mountains",
            "link": "https://www.youtube.com/watch?v=-C-a8HQl41I",
            "description": "Munnar, Kerala"
          },
          {
            "title": "Thunderstorm",
            "link": "https://www.youtube.com/watch?v=aZ2eAJr2Ybg",
            "description": "Bangalore, Karnataka"
          },
          {
            "title": "The Infamous Bangalore Traffic",
            "link": "https://www.youtube.com/watch?v=bqmzpVRC51k",
            "description": "Bangalore, Karnataka"
          },
          {
            "title": "BIA Airport Promo (not released yet)",
            "link": "#",
            "description": ""
          }
        ]
      },
      {
        "title": "Event recordings",
        "projects": [
          {
            "title": "Anamika - The nameless with many face(t)s",
            "link": "https://www.youtube.com/watch?v=68bsJv38J60",
            "description": "Classical dance performance (Seva Sadan, Bangalore)"
          },
          {
            "title": "Improv Comedy Bangalore",
            "link": "https://www.youtube.com/watch?v=xuM3tEUrOLU",
            "description": "Improv comedy performance (NCBS, Bangalore)"
          },
          {
            "title": "Dashavatar",
            "link": "https://www.youtube.com/watch?v=ryaFyE4ykvI",
            "description": "Classical dance performance (NCBS, Bangalore)"
          },
          {
            "title": "Colors of India",
            "link": "https://www.youtube.com/watch?v=9MPg_1wtnu0",
            "description": "Folk dance performance (NCBS, Bangalore)"
          }
        ]
      },
      {
        "title": "Interviews",
        "projects": [
          {
            "title": "NCBS Annual Talks 2014 (video publicly not available)",
            "link": "#",
            "description": ""
          },
          {
            "title": "Untold Narratives (video publicly not available)",
            "link": "#",
            "description": ""
          }
        ]
      }
    ]
  },
  "comics": {
    "summary": "Embarking on my latest artistic venture, I find myself captivated by the enchanting realm of comic creation. Blending digital finesse with the charm of traditional techniques, I breathe life into captivating characters and weave intricate narratives on vibrant panels. Every stroke of the pen or brush exudes a vivid imagination, guiding readers through compelling visual stories that transcend the boundaries of reality. This journey into the world of comics has become an exhilarating fusion of technology and timeless artistry, invigorating my passion for storytelling with each new creation.",
    "projects": [
      {
        "thumb": "acknowThumb",
        "header": "Chronicles of the GreatFool Soul",
        "authors": "Rohit Suratekar",
        "pdf": "acknowPdf",
        "size": "5.6MB",
        "desc": "After successfully defending my PhD thesis at the National Centre for Biological Sciences on 29th October 2018, I felt immense gratitude towards the countless individuals who contributed to my academic journey of nearly 6 years. The \"Acknowledgements\" section was an opportunity to express my appreciation, but I wanted to do it uniquely. I decided to transform my heartfelt sentiments into a captivating comic strip.<br><br>Each panel of this carefully crafted comic strip holds cherished memories and emotions, paying tribute to the wonderful people who played significant roles in my academic pursuit. While some references may be familiar only to those acquainted with the characters, this comic remains a cherished memento of our shared experiences. Amidst millions of memories, this heartfelt creation remains closest to my heart.<br>Feel free to download this heartfelt comic by clicking the buttons below, and join me in celebrating the incredible people who shaped my academic journey."
      },
      {
        "thumb": "sheThumb",
        "header": "(S)he",
        "authors": "Aparna Agarwal and Rohit Suratekar",
        "pdf": "shePdf",
        "size": "440.4kB",
        "desc": "In a whimsical exploration, I ventured beyond traditional comic storytelling, embracing a new challenge - comedicizing a poem. Aparna, a talented poet and my Ph.D. batchmate, graciously allowed me to reimagine her work. The result? A delightful comic fusion that celebrates artistry and humor.<br><br>This collaborative journey infused new poetic scenarios, adding a unique twist to the original verses. With meticulous attention to detail and heartfelt arrangements, I captured my emotions and perspectives within this artistic creation.<br><br>Witness the beauty of Aparna's poem, now adorned with a sprinkle of laughter, in this creative ode to the boundless realms of creativity. Enjoy the poetic gem, as art takes on diverse interpretations and celebrates the joy of artistic discovery."
      },
      {
        "thumb": "republicThumb",
        "header": "Republic of Bacteria",
        "authors": "Rohit Suratekar",
        "pdf": "republicPdf",
        "size": "598kB",
        "desc": "Amidst a creative journey that included learning new techniques and practicing illustrations, a serendipitous moment sparked an exciting new comic series. While exploring articles on bacterial antibiotic-resistance, I came across Sruthi Balakrishnan's captivating write-up. Playfully, I <a class='text-link' href='https://twitter.com/rohitsuratekar/status/1314325171700989952?s=20' target='_blank'>tweeted</a> to her, suggesting a comic adaptation of her blog post.<br><br>Little did I know that this seemingly casual comment would plant the seeds for an extraordinary project. The idea began brewing, and a few hours later, I found myself embarking on a thrilling endeavor - a comic series dedicated to the fascinating world of bacteria.<br><br>With artistic inspiration flowing, I bring you the current comic-strip, a culmination of that initial tweet and the boundless creativity that followed. Before you dive into this microbial adventure, I encourage you to read Sruthi's enlightening <a href='https://massivesci.com/notes/antibiotic-resistant-susceptible-bacteria-cell-walls/' target='_blank' class='text-link'>article</a>. Understanding the context will further enrich your experience as we explore the mesmerizing realms of bacteria through the lens of art."
      }
    ]
  }
}
